export const list = () => {
    return [change_v4, change_v3, change_v2, change_v1];
}

export const getUpdateNumber = () => {
    return list().length;
}

export const change_v1 = () => {
    return {
        version: 'V_0.0.1', time: '22/08/2023',
        new_feature: ['Створено нову сторінку ChangeLog (видно лише адміну)',
            'Створена перевірка при реєстрації',
            'Логін тепер має бути довшим ніж 4 символа',
            'Пароль тепер перевіряється на слабкість',
            'Користувач має повторити пароль при реєстрації',
            'Добавлена функція перегляду пароля при реєстрації',
            'Добавлена reCAPTCHA при реєстрації',],
        update: ['Розсадники тепер можна створити та видалити',
            'Оновлено систему додавання до категорії Улюблено',
            'Оновлено керування Користувачами'],

        fixed: ['Розсаду знову можна редагувати натиснувши на кнопку "Детальніше"'],
        deleted: ['Кнопка Профіль видалена', 'Функція забув пароль видалена']
    };
};

export const change_v2 = () => {
    return {
        version: 'V_0.0.2', time: '25/08/2023',
        new_feature: ['Добавлений refresh token',],
        update: ['Змінена система Додавання/Редугавання розсад',
            'Змінена головна сторінка',
            'Змінена сторінка Улюблене',
            'Змінена сторінка Розсадники',
            'Якщо у розсади немає зображення буде відображатись no_image.png',
            'Оновлено перегляд користувача'],
        fixed: ['У панелі керування розсадниками знову можна переглянути добавлену розсаду.',
            'Фільтр знову відображає результат'],

    };
};

export const change_v3 = () => {
    return {
        version: 'V_0.0.3', time: '28/08/2023',
        new_feature: ['Додано елемент Недавно переглянуті',
            'Копія бази даних буде створюватись кожен день в 22:00'],
        update: ['Тепер є можливість ввійти в акаунт за допомогою пошти'],
        fixed: ['Рефреш токен тепер працює (вхід у систему буде відбуватись автоматично, якщо користувач відкрив сайт впродовж 21 дня)',
            'Footer тепер показується лише в нижній частині сайту'],
        deleted: ['Кнопка видалити розсаду була видалена з панелі керування',
            'Кнопка видалити розсадника була видалена']
    };
};

export const change_v4 = () => {
    return {
        version: 'V_0.0.4', time: '30/08/2023',
        new_feature: ['Добавлена сторінка з окремим розсадником'],
        update: ['Добавлено нумерування сторінок наявної розсади у панелі керування розсадниками',
            'Оптимізовано панель керування розсадниками',
            'Добавлена нумерація для панелі керування користувачами',
            'Добавлена підтримка головної сторінки на мобільний додаток']
    }
};


  //new_feature
  //update
  //deleted
  //fixed