export const informationText = () => { 
    return [
      { title: 'Ласкаво просимо на веб-сайт пошуку сажанців та рослин!' },
      { text: 'Сайт допомагає вам знайти бажані рослини та сажанці швидко та зручно. Використовуючи нашу потужну систему пошуку, ви можете вказати різні параметри, такі як вид рослини, кольори квітів, витривалість, висота та багато іншого.'},
      { text: 'Ми пропонуємо широкий вибір рослин з різних категорій, включаючи декоративні квіти, дерева, кущі, ягоди та багато іншого. У нас є детальні описи кожної рослини, включаючи зображення, характеристики та поради щодо догляду.'},
      { text: 'Крім того, сайт надає можливість зберігати ваші улюблені рослини у списку обраного, щоб ви могли легко знайти їх у майбутньому'},
      { text: 'Запрошуємо вас скористатися сайтом і знайти ідеальні рослини для вашого саду або ландшафту. Раді будемо допомогти вам у вашому пошуку!'},
    ];
  };

  export const advantages = () => { 
    return [
      { "title": "Переваги нашого веб-сайту" },
      { "subtitle": "Доступність для всіх користувачів" },
      { "text": "Наш веб-сайт створений з урахуванням простоти та доступності для усіх користувачів. Він призначений для людей, які зацікавлені в садівництві та вирощуванні рослин, незалежно від їх рівня досвіду або професійної спеціалізації." },
      { "text" : ' '},
      { "subtitle": "Потужна система пошуку" },
      { "text": "Наша система пошуку дозволяє користувачам знайти рослини за різними параметрами, такими як вид рослини, кольори квітів, висота, витривалість тощо. Це допомагає знайти бажані рослини швидко та зручно." },
      { "text" : ' '},
      { "subtitle": "Розширений вибір рослин" },
      { "text": "Наш веб-сайт пропонує широкий вибір рослин з різних категорій, що включає декоративні квіти, дерева, кущі, ягоди та багато іншого. Ми прагнемо задовольнити потреби різних користувачів і надаємо детальні описи кожної рослини зі зображеннями, характеристиками та порадами щодо догляду." },
      { "text" : ' '},
      { "subtitle": "Збереження улюблених рослин" },
      { "text": "Наш сайт надає можливість користувачам зберігати свої улюблені рослини у списку обраного. Це дозволяє зручно зберігати та організовувати рослини, які вас зацікавили, і легко знайти їх у майбутньому." }];
  };